In [86]:
# https://rk1993.tistory.com/entry/Python%ED%8C%8C%EC%9D%B4%EC%8D%AC%EC%97%90%EC%84%9C-Oracle-DB-%EC%97%B0%EB%8F%99%ED%95%98%EB%8A%94-%EB%B0%A9%EB%B2%95
# https://kaikaikai.tistory.com/68?category=943368
#

In [87]:
import cx_Oracle
import os

os.putenv('NLS_LANG', '.UTF8')#한글

LOCATION = r"C:\instantclient_19_12"

os.environ["PATH"] = LOCATION + ";" + os.environ["PATH"] #환경변수 등록

In [ ]:


connection = cx_Oracle.connect('bg','bg','localhost:1521/XE')

# localhost:1521:XE 아이디 넣고 비번넣고
cursor = connection.cursor()

In [79]:
import pandas as pd

cursor = connection.cursor()

dd=(cursor.execute("""
   select * from t_member order by joinDate desc """
))

dd = pd.DataFrame(dd)
dd

      0     1    2               3                   4
0  cha2   123  차두리   cha2@test.com 2021-09-16 11:56:26
1  park   123  박지성   park@test.com 2021-09-16 11:56:02
2  cha1   123  차범근   cha1@test.com 2021-09-16 11:55:21
3   kim  1212  김유신   kim@gmail.com 2021-08-25 09:55:44
4   lee  1212  이순신   lee@gmail.com 2021-08-20 09:39:14
5  hong  1212  홍길동  hong@gmail.com 2021-08-20 09:39:12

In [ ]:
# 저장하기 소스
# dd.to_csv('D:/Oracle_DataFrame.csv', index=False, encoding='cp949')

In [80]:
dd=(cursor.execute("""
   select * from t_member where id = 'hong' """
))

dd = pd.DataFrame(dd)
dd

      0     1    2               3                   4
0  hong  1212  홍길동  hong@gmail.com 2021-08-20 09:39:12

In [81]:
dd=(cursor.execute("""
   select * from t_member where pwd = '1212' """
))

dd = pd.DataFrame(dd)
dd

      0     1    2               3                   4
0  hong  1212  홍길동  hong@gmail.com 2021-08-20 09:39:12
1   lee  1212  이순신   lee@gmail.com 2021-08-20 09:39:14
2   kim  1212  김유신   kim@gmail.com 2021-08-25 09:55:44

In [5]:
# https://gent.tistory.com/322

dd=cursor.execute("""
create table customer (
   ID		int		not null,
   name		varchar(20)	not null,
   age		int		not null,
   address	char(25),
   salary	decimal(18, 2)
)   
   """
)

dd = pd.DataFrame(dd)
dd

In [82]:
dd=cursor.execute("""
INSERT INTO customer 
VALUES (72781231, 'SCOTT', 33, '주소', 20000)
   
   """
)

In [83]:
dd=(cursor.execute("""
   select * from customer """
))

dd = pd.DataFrame(dd)
dd

          0      1   2                      3        4
0      7788  SCOTT  33  주소                     20000.0
1      7781  SCOTT  33  주소                     20000.0
2  72781231  SCOTT  33  주소                     20000.0
3  72781231  SCOTT  33  주소                     20000.0

In [84]:
dd=cursor.execute("""
delete from customer where ID=72781   
   """
)